modm-ext/archive-stmicro-svd/html_rm0399_stm32h745bgt6@m4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>JPEG</name>
      <baseAddress>0x52003000</baseAddress>
      <registers>
        <register>
          <name>CONFR0</name>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>START</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR1</name>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COLSPACE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NS</name>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>HDR</name>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>YSIZE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR2</name>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>NMCU</name>
              <bitOffset>0</bitOffset>
              <bitWidth>26</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR3</name>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>XSIZE</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR4</name>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HA</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NB</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VSF</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HSF</name>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR5</name>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HA</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NB</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VSF</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HSF</name>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR6</name>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HA</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NB</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VSF</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HSF</name>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFR7</name>
          <addressOffset>0x1c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>HD</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HA</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QT</name>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>NB</name>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VSF</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HSF</name>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>JCEN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFTIE</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFNFIE</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFTIE</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFNEIE</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOCIE</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPDIE</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFF</name>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFF</name>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IFTF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IFNFF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFTF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFNEF</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOCF</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPDF</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COF</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CEOCF</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CHPDF</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DIR</name>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATAIN</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR</name>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATAOUT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>QMEM0.0</name>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.1</name>
          <addressOffset>0x54</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.2</name>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.3</name>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.4</name>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.5</name>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.6</name>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.7</name>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.8</name>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.9</name>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.10</name>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.11</name>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.12</name>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.13</name>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.14</name>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM0.15</name>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.0</name>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.1</name>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.2</name>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.3</name>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.4</name>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.5</name>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.6</name>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.7</name>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.8</name>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.9</name>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.10</name>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.11</name>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.12</name>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.13</name>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.14</name>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM1.15</name>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.0</name>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.1</name>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.2</name>
          <addressOffset>0xd8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.3</name>
          <addressOffset>0xdc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.4</name>
          <addressOffset>0xe0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.5</name>
          <addressOffset>0xe4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.6</name>
          <addressOffset>0xe8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.7</name>
          <addressOffset>0xec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.8</name>
          <addressOffset>0xf0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.9</name>
          <addressOffset>0xf4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.10</name>
          <addressOffset>0xf8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.11</name>
          <addressOffset>0xfc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.12</name>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.13</name>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.14</name>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM2.15</name>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.0</name>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.1</name>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.2</name>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.3</name>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.4</name>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.5</name>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.6</name>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.7</name>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.8</name>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.9</name>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.10</name>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.11</name>
          <addressOffset>0x13c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.12</name>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.13</name>
          <addressOffset>0x144</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.14</name>
          <addressOffset>0x148</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>QMEM3.15</name>
          <addressOffset>0x14c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.0</name>
          <addressOffset>0x150</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.1</name>
          <addressOffset>0x154</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.2</name>
          <addressOffset>0x158</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.3</name>
          <addressOffset>0x15c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.4</name>
          <addressOffset>0x160</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.5</name>
          <addressOffset>0x164</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.6</name>
          <addressOffset>0x168</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.7</name>
          <addressOffset>0x16c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.8</name>
          <addressOffset>0x170</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.9</name>
          <addressOffset>0x174</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.10</name>
          <addressOffset>0x178</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.11</name>
          <addressOffset>0x17c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.12</name>
          <addressOffset>0x180</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.13</name>
          <addressOffset>0x184</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.14</name>
          <addressOffset>0x188</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFMIN.15</name>
          <addressOffset>0x18c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE.0</name>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE.1</name>
          <addressOffset>0x194</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE.2</name>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE.3</name>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE.4</name>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE.5</name>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE.6</name>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE.7</name>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE.8</name>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE.9</name>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE.10</name>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE.11</name>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFBASE.12</name>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
        </register>
